binaryclock01/stm32_ford_superduty_can_bus_gateway/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
// Add any additional includes here
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
// Define any additional types here
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

// #define LOOPBACK_MODE

#include "cmsis_os.h"        // RTOS CMSIS types, such as osMutedId_t
#include "device_configs.h"
#include "ssd1306_conf.h"
//#include "rtos.h"


/* ---| CAN TYPES CONSTANTS |------------------------------------------------ */

//#define CAN_TRUCK 0
//#define CAN_AUX   1
//#define CAN_MAX   2

/**
 * @brief CAN-related variables.
 */
extern CAN_HandleTypeDef hcan1;
extern CAN_HandleTypeDef hcan2;
extern I2C_HandleTypeDef hi2c1;

extern osMessageQueueId_t CAN1_Rx_QueueHandle;
extern osMessageQueueId_t CAN2_Rx_QueueHandle;
extern osMessageQueueId_t Tx_QueueHandle;
extern UART_HandleTypeDef huart2;

/**
 * @brief Display-related variables.
 */

/**
 * @brief Time-related variables.
 */
extern uint32_t last_can_request_time; /**< Last CAN request timestamp. */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/**
 * @brief Check if a value is within a given range.
 * @param value The value to check.
 * @param min The minimum range value.
 * @param max The maximum range value.
 * @return True if value is in range, false otherwise.
 */
#define IN_RANGE(value, min, max) ((value) >= (min) && (value) <= (max))

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
// Add any additional exported function prototypes here
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TOUCH_MISO_Pin GPIO_PIN_6
#define TOUCH_MISO_GPIO_Port GPIOA
#define DISPL_MOSI_Pin GPIO_PIN_7
#define DISPL_MOSI_GPIO_Port GPIOA
#define DISPL_CS_Pin GPIO_PIN_4
#define DISPL_CS_GPIO_Port GPIOC
#define TOUCH_CS_Pin GPIO_PIN_5
#define TOUCH_CS_GPIO_Port GPIOC
#define DISPL_DC_Pin GPIO_PIN_1
#define DISPL_DC_GPIO_Port GPIOB
#define DISPL_RST_Pin GPIO_PIN_2
#define DISPL_RST_GPIO_Port GPIOB
#define DISPL_LED_Pin GPIO_PIN_7
#define DISPL_LED_GPIO_Port GPIOC
#define TOUCH_INT_Pin GPIO_PIN_10
#define TOUCH_INT_GPIO_Port GPIOA
#define TOUCH_INT_EXTI_IRQn EXTI15_10_IRQn
#define DISPL_SCK_Pin GPIO_PIN_3
#define DISPL_SCK_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
// Add any additional private defines here
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
